import * as React from 'react';
import './form.css'

export const FormEmail = (props) =>
{
    return(
        <div className='form'>        
            <h1>
                Создать аккаунт
            </h1>
            <h3>
                Введите свою почту, чтобы создать учётную запись.
            </h3>

            <h2>
                Почта
            </h2>
            <div className='input-holder' style={props.error.field1 ? {border: '1px solid red'} : null}>
                <input
                    className='input-with-svg'
                    type='email'
                    placeholder='Введите почту'
                    onChange={(e) => {
                        props.updateFormData(
                        {
                            ...props.formData,
                            email: e.target.value,
                        })}}
                    value={props.formData.email}
                />
                <div className='icon-holder'>
                    <span>
                        <svg width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M17.5 0H2.5C1.83718 0.000721921 1.2017 0.269135 0.733016 0.746344C0.264329 1.22355 0.000709029 1.87058 0 2.54545V13.4545C0.000709029 14.1294 0.264329 14.7764 0.733016 15.2537C1.2017 15.7309 1.83718 15.9993 2.5 16H17.5C18.1628 15.9993 18.7983 15.7309 19.267 15.2537C19.7357 14.7764 19.9993 14.1294 20 13.4545V2.54545C19.9993 1.87058 19.7357 1.22355 19.267 0.746344C18.7983 0.269135 18.1628 0.000721921 17.5 0ZM16.867 4.21045L10.4384 9.30136C10.313 9.40059 10.1588 9.45445 10 9.45445C9.84122 9.45445 9.68696 9.40059 9.56161 9.30136L3.13304 4.21045C3.05751 4.15238 2.99407 4.0796 2.9464 3.99634C2.89873 3.91309 2.86779 3.82102 2.85538 3.72548C2.84296 3.62995 2.84932 3.53285 2.87408 3.43984C2.89884 3.34683 2.9415 3.25975 2.9996 3.18367C3.05769 3.1076 3.13006 3.04403 3.21249 2.99668C3.29492 2.94932 3.38577 2.91912 3.47977 2.90782C3.57376 2.89653 3.66903 2.90436 3.76002 2.93088C3.85102 2.95739 3.93593 3.00206 4.00982 3.06227L10 7.80591L15.9902 3.06227C16.14 2.9471 16.3283 2.89659 16.5143 2.92166C16.7004 2.94673 16.8693 3.04536 16.9845 3.19624C17.0997 3.34711 17.152 3.5381 17.13 3.72789C17.108 3.91769 17.0135 4.09104 16.867 4.21045Z" fill="#8D9496"/>
                        </svg>
                    </span>    
                </div>
            </div>
            {props.error.field1 && <p className='error'>Введите корректный email!</p>}

            <hr />
            <div className='continue-with'>
                <h2 className='text-have-an-account'>У вас уже есть аккаунт?</h2>
                <a href='/auth' className='link'>Войти</a>
            </div>
            <h2 className='text-continue-with'>
                или продолжить
            </h2>
            <div className='continue-with-button-container'>
                <button className='continue-with-button'>
                    <span>
                        <svg width="20" height="19" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0_908_883)">
                        <path d="M24.0078 12.2245C24.0078 11.2412 23.9295 10.5237 23.7598 9.7796H12.7295V14.2176H19.2041C19.0736 15.3205 18.3687 16.9814 16.8022 18.0975L16.7802 18.2461L20.2678 20.9963L20.5095 21.0209C22.7285 18.9347 24.0078 15.8653 24.0078 12.2245Z" fill="#5A96F5"/>
                        <path d="M12.7296 23.9176C15.9016 23.9176 18.5645 22.8545 20.5095 21.0209L16.8023 18.0976C15.8102 18.8018 14.4787 19.2934 12.7296 19.2934C9.6228 19.2934 6.98598 17.2074 6.04603 14.324L5.90825 14.3359L2.2818 17.1927L2.23438 17.3269C4.1663 21.2334 8.13462 23.9176 12.7296 23.9176Z" fill="#3ABB5D"/>
                        <path d="M6.04621 14.324C5.7982 13.5799 5.65466 12.7826 5.65466 11.9588C5.65466 11.1349 5.7982 10.3377 6.03316 9.5936L6.02659 9.43513L2.3547 6.53241L2.23457 6.59058C1.43833 8.21168 0.981445 10.0321 0.981445 11.9588C0.981445 13.8855 1.43833 15.7058 2.23457 17.3269L6.04621 14.324Z" fill="#FBC41E"/>
                        <path d="M12.7295 4.62403C14.9356 4.62403 16.4237 5.59401 17.2722 6.40461L20.5878 3.10928C18.5515 1.1826 15.9015 0 12.7295 0C8.13462 0 4.1663 2.68406 2.23438 6.59056L6.03297 9.59359C6.98597 6.7102 9.62279 4.62403 12.7295 4.62403Z" fill="#ED5A4C"/>
                        </g>
                        <defs>
                        <clipPath id="clip0_908_883">
                        <rect width="23.04" height="24" fill="white" transform="translate(0.980469)"/>
                        </clipPath>
                        </defs>
                        </svg>
                    </span>
                </button>
                <button className='continue-with-button'>
                    <span>
                        <svg width="20" height="19" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0_908_890)">
                        <path d="M12.5 0C5.8724 0 0.5 5.3724 0.5 12C0.5 18.6276 5.8724 24 12.5 24C19.1276 24 24.5 18.6276 24.5 12C24.5 5.3724 19.1276 0 12.5 0Z" fill="url(#paint0_linear_908_890)"/>
                        <path d="M14.2281 16.8578H17.4846L17.9961 13.5496H14.2281V11.7414C14.2281 10.3673 14.6773 9.14861 15.9627 9.14861H18.0282V6.26199C17.6652 6.21292 16.8976 6.10596 15.4474 6.10596C12.4186 6.10596 10.6431 7.7053 10.6431 11.3494V13.5503H7.5293V16.8584H10.6424V25.9512C11.259 26.043 11.8838 26.106 12.5249 26.106C13.1044 26.106 13.67 26.0531 14.2281 25.9776V16.8578Z" fill="white"/>
                        </g>
                        <defs>
                        <linearGradient id="paint0_linear_908_890" x1="4.0958" y1="3.5958" x2="22.469" y2="21.969" gradientUnits="userSpaceOnUse">
                        <stop stop-color="#2AA4F4"/>
                        <stop offset="1" stop-color="#007AD9"/>
                        </linearGradient>
                        <clipPath id="clip0_908_890">
                        <rect width="24" height="24" fill="white" transform="translate(0.5)"/>
                        </clipPath>
                        </defs>
                        </svg>
                    </span>
                </button>
            </div>
        </div>
    )
}
